In [1]:
import numpy as np
import pandas as pd

In [168]:
stdData = {
    'math': [23,45,67,89,56],
    'physics': [13,88,95,34,77],
    'chemistry': [45,34,55,78,67],
    'computer science': [45,34,55,78,67]
}
std = ['nasir','mansoor','kashan','imad','shifa']
stdFrame = pd.DataFrame(stdData, index=std)
stdFrame

         math  physics  chemistry  computer science
nasir      23       13         45                45
mansoor    45       88         34                34
kashan     67       95         55                55
imad       89       34         78                78
shifa      56       77         67                67

In [49]:
stdFrame['total'] = stdFrame['math'] + stdFrame['physics'] + stdFrame['chemistry']
stdFrame

         math  physics  chemistry  total
nasir      23       13         45     81
mansoor    45       88         34    167
kashan     67       95         55    217
imad       89       34         78    201
shifa      56       77         67    200

In [50]:
stdFrame['remarks1'] = ["Fail" if num < 200 else "Pass" for num in stdFrame['total']]
stdFrame

         math  physics  chemistry  total remarks1
nasir      23       13         45     81     Fail
mansoor    45       88         34    167     Fail
kashan     67       95         55    217     Pass
imad       89       34         78    201     Pass
shifa      56       77         67    200     Pass

In [51]:
stdFrame['per'] = stdFrame['total']/300 * 100
stdFrame['per'] = [str(i)+"%" for i in stdFrame['per']]
stdFrame

         math  physics  chemistry  total remarks1                  per
nasir      23       13         45     81     Fail                27.0%
mansoor    45       88         34    167     Fail  55.666666666666664%
kashan     67       95         55    217     Pass   72.33333333333334%
imad       89       34         78    201     Pass                67.0%
shifa      56       77         67    200     Pass   66.66666666666666%

In [52]:
zip1 = zip(stdFrame['math'], stdFrame['physics'], stdFrame['chemistry'])
for m,p,c in zip1:
    print(m)

23
45
67
89
56

In [150]:
stdFrame['remarks'] = ["Pass" if m >= 33 and p >= 33 and c >= 33 else "Fail" for m, p, c in zip(stdFrame['math'], stdFrame['physics'], stdFrame['chemistry'])
                    ]

In [151]:
stdFrame

         math  physics  chemistry  computer science remarks
nasir      23       13         45                45    Fail
mansoor    45       88         34                34    Pass
kashan     67       95         55                55    Pass
imad       89       34         78                78    Pass
shifa      56       77         67                67    Pass
yasir      45       67         78                99    Pass

In [55]:
stdFrame.T

,nasir,mansoor,kashan,imad,shifa
math,23,45,67,89,56
physics,13,88,95,34,77
chemistry,45,34,55,78,67
total,81,167,217,201,200
remarks1,Fail,Fail,Pass,Pass,Pass
per,27.0%,55.666666666666664%,72.33333333333334%,67.0%,66.66666666666666%
remarks,Fail,Pass,Pass,Pass,Pass

In [56]:
stdFrame

         math  physics  chemistry  total remarks1                  per remarks
nasir      23       13         45     81     Fail                27.0%    Fail
mansoor    45       88         34    167     Fail  55.666666666666664%    Pass
kashan     67       95         55    217     Pass   72.33333333333334%    Pass
imad       89       34         78    201     Pass                67.0%    Pass
shifa      56       77         67    200     Pass   66.66666666666666%    Pass

In [57]:
del stdFrame['remarks1']

In [58]:
stdFrame

         math  physics  chemistry  total                  per remarks
nasir      23       13         45     81                27.0%    Fail
mansoor    45       88         34    167  55.666666666666664%    Pass
kashan     67       95         55    217   72.33333333333334%    Pass
imad       89       34         78    201                67.0%    Pass
shifa      56       77         67    200   66.66666666666666%    Pass

In [59]:
print(stdFrame.columns)
print(stdFrame.index)

Index(['math', 'physics', 'chemistry', 'total', 'per', 'remarks'], dtype='object')
Index(['nasir', 'mansoor', 'kashan', 'imad', 'shifa'], dtype='object')

In [60]:
stdFrame.index.name = 'Students Data'

In [61]:
stdFrame.index

Index(['nasir', 'mansoor', 'kashan', 'imad', 'shifa'], dtype='object', name='Students Data')

In [62]:
stdFrame

               math  physics  chemistry  total                  per remarks
Students Data
nasir            23       13         45     81                27.0%    Fail
mansoor          45       88         34    167  55.666666666666664%    Pass
kashan           67       95         55    217   72.33333333333334%    Pass
imad             89       34         78    201                67.0%    Pass
shifa            56       77         67    200   66.66666666666666%    Pass

In [68]:
stdFrame['computer science']

nasir      45
mansoor    34
kashan     55
imad       78
shifa      67
Name: computer science, dtype: int64

In [73]:
for i in stdFrame.columns:
    if 'computer science' in i:
        print(True)
    else:
        print(False)

False
False
False
True

In [76]:
'computer science' in stdFrame.columns

True

In [94]:
obj3 = pd.Series(['blue', 'purple', 'yellow'], index=[0, 2, 8])
obj3

0      blue
2    purple
8    yellow
dtype: object

In [95]:
obj3.reindex(range(9), method='ffill')

0      blue
1      blue
2    purple
3    purple
4    purple
5    purple
6    purple
7    purple
8    yellow
dtype: object

In [103]:
frame = pd.DataFrame(np.arange(100).reshape((20, 5)), index=range(0,100,5),
                     columns=['Ohio', 'Texas', 'California', 'abc','abc'])
frame

    Ohio  Texas  California  abc  abc
0      0      1           2    3    4
5      5      6           7    8    9
10    10     11          12   13   14
15    15     16          17   18   19
20    20     21          22   23   24
25    25     26          27   28   29
30    30     31          32   33   34
35    35     36          37   38   39
40    40     41          42   43   44
45    45     46          47   48   49
50    50     51          52   53   54
55    55     56          57   58   59
60    60     61          62   63   64
65    65     66          67   68   69
70    70     71          72   73   74
75    75     76          77   78   79
80    80     81          82   83   84
85    85     86          87   88   89
90    90     91          92   93   94
95    95     96          97   98   99

In [108]:
stdFrame.loc['yasir'] = [45,67,78,99]
stdFrame

         math  physics  chemistry  computer science
nasir      23       13         45                45
mansoor    45       88         34                34
kashan     67       95         55                55
imad       89       34         78                78
shifa      56       77         67                67
yasir      45       67         78                99

In [113]:
stdFrame.iloc[0:2]

         math  physics  chemistry  computer science
nasir      23       13         45                45
mansoor    45       88         34                34

In [114]:
stdFrame.loc['nasir':'kashan']

         math  physics  chemistry  computer science
nasir      23       13         45                45
mansoor    45       88         34                34
kashan     67       95         55                55

In [132]:
obj = pd.Series([1,2,0,np.nan,7], index=['a', 'b', 'c', 'd', 'e'])
obj

a    1.0
b    2.0
c    0.0
d    NaN
e    7.0
dtype: float64

In [133]:
new_obj = obj.drop('c')
# obj.fillna(3, inplace=True)
obj = obj.fillna(3)

In [134]:
obj

a    1.0
b    2.0
c    0.0
d    3.0
e    7.0
dtype: float64

In [142]:
stdFrame[['physics','math']]

         physics  math
nasir         13    23
mansoor       88    45
kashan        95    67
imad          34    89
shifa         77    56
yasir         67    45

In [163]:
stdFrame[(stdFrame['physics'] > 60) | (stdFrame['math'] > 50)]

         math  physics  chemistry  computer science
mansoor    45       88         34                34
kashan     67       95         55                55
imad       89       34         78                78
shifa      56       77         67                67

In [155]:
del stdFrame['remarks']

In [185]:
stdData = {
    'math': [23,45,67,89,56],
    'physics': [13,88,95,34,77],
    'chemistry': [45,34,55,78,67],
    'computer science': [45,34,55,78,67]
}
std = ['nasir','mansoor','kashan','imad','shifa']
stdFrame = pd.DataFrame(stdData, index=std)
stdFrame

         math  physics  chemistry  computer science
nasir      23       13         45                45
mansoor    45       88         34                34
kashan     67       95         55                55
imad       89       34         78                78
shifa      56       77         67                67

In [186]:
# stdFrame.where(stdFrame < 33,"Pass", inplace=True)

In [193]:
stdFrame.loc['nasir',['math','chemistry']]

math         23
chemistry    45
Name: nasir, dtype: int64

In [242]:
stdFrame.loc[::-1,::-1]

         computer science  chemistry  physics  math
shifa                  67         67       77    56
imad                   78         78       34    89
kashan                 55         55       95    67
mansoor                34         34       88    45
nasir                  45         45       13    23

In [202]:
stdFrame.iloc[[1,2],[0,3]]

         math  computer science
mansoor    45                34
kashan     67                55

In [203]:
stdFrame

         math  physics  chemistry  computer science
nasir      23       13         45                45
mansoor    45       88         34                34
kashan     67       95         55                55
imad       89       34         78                78
shifa      56       77         67                67

In [231]:
f = lambda x: [x.max(),x.min(),x.sum()]
stdFrame[['math','physics']].apply(f)
# minMax(stdFrame['math'])

math       [89, 23, 280]
physics    [95, 13, 307]
dtype: object

In [227]:
stdFrame.apply(f, axis=1)

nasir      [45, 13, 126]
mansoor    [88, 34, 201]
kashan     [95, 55, 272]
imad       [89, 34, 279]
shifa      [77, 56, 267]
dtype: object

In [229]:
l1 = list(range(1,1000,34))
min(l1)

1

In [239]:
format1 = lambda x: x**2
stdFrame[['math','physics']].applymap(format1)

         math  physics
nasir     529      169
mansoor  2025     7744
kashan   4489     9025
imad     7921     1156
shifa    3136     5929

In [245]:
f1 = lambda x,y: x + y
f1(2,4)

6

In [252]:
f2 = lambda x: np.square(x)
stdFrame['math'].map(f2)

nasir       529
mansoor    2025
kashan     4489
imad       7921
shifa      3136
Name: math, dtype: int64

In [266]:
f3 = lambda x: "Pass" if x > 33 else "Fail"
stdFrame['math'].map(f3)

nasir      Fail
mansoor    Pass
kashan     Pass
imad       Pass
shifa      Pass
Name: math, dtype: object

In [267]:
stdFrame.applymap(f3)

         math physics chemistry computer science
nasir    Fail    Fail      Pass             Pass
mansoor  Pass    Pass      Pass             Pass
kashan   Pass    Pass      Pass             Pass
imad     Pass    Pass      Pass             Pass
shifa    Pass    Pass      Pass             Pass

In [269]:
f4 = lambda x: ["Pass" if i > 33 else "Fail" for i in x]
stdFrame.apply(f4)

         math physics chemistry computer science
nasir    Fail    Fail      Pass             Pass
mansoor  Pass    Pass      Pass             Pass
kashan   Pass    Pass      Pass             Pass
imad     Pass    Pass      Pass             Pass
shifa    Pass    Pass      Pass             Pass

In [273]:
stdFrame.sort_index()

         math  physics  chemistry  computer science
imad       89       34         78                78
kashan     67       95         55                55
mansoor    45       88         34                34
nasir      23       13         45                45
shifa      56       77         67                67

In [275]:
stdFrame.sort_index(ascending=False)

         math  physics  chemistry  computer science
shifa      56       77         67                67
nasir      23       13         45                45
mansoor    45       88         34                34
kashan     67       95         55                55
imad       89       34         78                78

In [277]:
stdFrame.sort_values(by="math", inplace=True)

In [278]:
stdFrame

         math  physics  chemistry  computer science
nasir      23       13         45                45
mansoor    45       88         34                34
shifa      56       77         67                67
kashan     67       95         55                55
imad       89       34         78                78